app/views/users/_user.html.haml

  .card-footer
    - user.roles.each do |role|
      .badge.badge-info
---
SELECT `roles`.* FROM `roles` INNER JOIN `users_roles` ON `roles`.`id` = `users_roles`.`role_id` WHERE `users_roles`.`user_id` = 1