app/views/users/index.html.haml

SELECT `roles`.* FROM `roles` INNER JOIN `users_roles` ON `roles`.`id` = `users_roles`.`role_id` WHERE `users_roles`.`user_id` = 1
---
        %td
          - user.roles.each do |role|
            .badge.bg-info