app/views/home/index.html.haml

      .fa.fa-graduation-cap
    = Course.count
---
SELECT COUNT(*) FROM `courses`

      /.fa.fa-brain
    = Course.distinct.count(:user_id)
---
SELECT COUNT(DISTINCT `courses`.`user_id`) FROM `courses`

      .fa.fa-user-graduate
    = User.count
---
SELECT COUNT(*) FROM `users`