app/helpers/courses_helper.rb

SELECT 1 AS one FROM `enrollments` WHERE `enrollments`.`course_id` = 1 AND `enrollments`.`user_id` = 1 LIMIT 1
SELECT `enrollments`.* FROM `enrollments` WHERE `enrollments`.`course_id` = 4 AND `enrollments`.`user_id` = 1 ORDER BY `enrollments`.`id` ASC LIMIT 1
---
  def review_button(course)
    user_course = course.enrollments.where(user: current_user)
    if current_user
      if user_course.any?
        if user_course.pending_review.any?
          link_to 'Add a review', edit_enrollment_path(user_course.first)
        else
          link_to 'Thanks for reviewing! Your Review', enrollment_path(user_course.first)