app/views/courses/_course.html.haml

SELECT COUNT(*) FROM `lessons` WHERE `lessons`.`course_id` = 1
---
        .fa.fa-tasks
        = course.lessons.count
    .card_footer
        .row
            .col-md-6
                .fa.fa-globe-africa