app/views/courses/index.html.haml

      = f.label :language
      = f.select :language_cont, Course.languages, include_blank: true
      = f.label :level
      = f.select :level_cont, Course.levels, include_blank: true
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`language` LIKE '%English%'
SELECT `courses`.* FROM `courses`