app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses`
---
  def index
    @ransack_courses = Course.ransack(params[:courses_search], search_key: :courses_search)
    @courses = @ransack_courses.result.includes(:user)

INSERT INTO `courses` (`title`, `description`, `created_at`, `updated_at`, `user_id`, `slug`) VALUES ('fafasfsas', 'fafasscasca', '2022-04-15 11:02:23.200689', '2022-04-15 11:02:23.200689', 3, 'fafasfsas')
---
  def create
    @course = Course.new(course_params)
    # tu dong them gmail nguoi dung vao cot
    @course.user = current_user

    respond_to do |format|
      if @course.save

UPDATE `courses` SET `courses`.`description` = 'Faker hello pro', `courses`.`updated_at` = '2022-04-17 08:59:06.931416', `courses`.`short_description` = '' WHERE `courses`.`id` = 1
---
  def update
    respond_to do |format|
      if @course.update(course_params)