app/controllers/enrollments_controller.rb

  def index
    #@enrollments = Enrollment.all
    @q = Enrollment.ransack(params[:q])
    @pagy, @enrollments = pagy(@q.result.includes(:user))
---
SELECT `enrollments`.* FROM `enrollments`

    def set_coruse
      @course = Course.friendly.find(params[:course_id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 4 LIMIT 1

    def set_enrollment
      # @enrollment = Enrollment.find(params[:id])
      @enrollment = Enrollment.friendly.find(params[:id])
---
SELECT `enrollments`.* FROM `enrollments` WHERE `enrollments`.`id` = 1 LIMIT 1