app/controllers/home_controller.rb

SELECT `courses`.* FROM `courses` ORDER BY `courses`.`created_at` DESC LIMIT 3
---
  def index
    @courses = Course.all.limit(3)

SELECT `activities`.* FROM `activities`
---
  def activity
    @activities = PublicActivity::Activity.all