app/controllers/lessons_controller.rb

  def create
    @lesson = Lesson.new(lesson_params)
    @course = Course.friendly.find(params[:course_id])
    @lesson.course_id = @course.id

    respond_to do |format|
      if @lesson.save
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
INSERT INTO `lessons` (`title`, `content`, `course_id`, `created_at`, `updated_at`, `slug`) VALUES ('hello', 'dkasafkafmadl', 4, '2022-04-19 08:44:22.015598', '2022-04-19 08:44:22.015598', 'hello')

    def set_lesson
      @course = Course.friendly.find(params[:course_id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1