app/controllers/users_controller.rb

  def update
    authorize @user
    if @user.update(user_params)
---
UPDATE `users` SET `users`.`updated_at` = '2022-04-18 07:28:57.358815' WHERE `users`.`id` = 1

  def set_user
        @user = User.friendly.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1